// pages/contact/contact.ts
Page({

  /**
   * 页面的初始数据
   */
  data: {
    introduce:"1.我们的目标是打造一个方便、安全、和谐的邻里分享平台，让每个家庭不再使用的物品能得到循环再利用，同时也能通过这个平台认识更多的邻居，增进邻里关系。\n \n2.如果用户发现有非法物品或者不良行为，可以通过联系客服功能向我们反馈。我们会尽快处理这些问题，并保护用户的权益。\n\n 3.在小程序的主界面，用户可以浏览到各种不同的物品。这些物品包括免费送的，也有低价卖的。用户可以通过分类或者搜索功能快速找到自己感兴趣的物品。\n\n 4.如果用户想发布自己的物品，只需要填写物品的基本信息（如名称、描述、图片等），并选择是免费送还是低价卖。为了保证信息的真实性和合法性，我们会对每一项信息进行审核。\n\n5.如果有其他问题还可以直接联系微信: z6868792"
  },
  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad() {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})